## ===========================================
## Series 인스턴스/객체 생성
## ===========================================
## -> 모듈로딩
## -------------------------------------------
import pandas as pd

## --------------------------------------------
## -> 데이터 준비
## --------------------------------------------
jumsu = [[99, 77, 55] , [22, 11, 66]]


## ---------------------------------------------
## -> DataFrame으로 변환 저장
## ---------------------------------------------
dataDF = pd.DataFrame(jumsu) 


## ---------------------------------------------
## -> List와 dataDataFrame 데이터 표현/저장 방식 비교
## ---------------------------------------------
print('---[LIST 방식]---')
print(jumsu)

print('\n---[DataFrame 방식]---')
print(dataDF)

## ---------------------------------------------
## -> dataDataFrame 인스턴스의 속성 읽기
## ---------------------------------------------
print('\n---[Series 속성 읽기]---')
print(f'인덱스 : {dataDF.index}')
print(f'컬럼즈 : {dataDF.columns}')
print(f'데이터 : \n{dataDF.values}, {type(dataDF.values)}')
print(f'형  태 : {dataDF.shape}')   ## 2차원으로 원소 수 반환
print(f'차  원 : {dataDF.ndim}차원') ## 2차원
print(f'타  입 : \n{dataDF.dtypes}')   ## 컬럼별 타입들