## -----------------------------------------------------
## 연락처 프로그램
## - 이름과 번호 저장
## - 목록 출력
## - 사용자의 종료 입력 전까지 반복
## -----------------------------------------------------

## 전역변수 선언
phonebook = []

## -----------------------------------------------------
## 메뉴 출력 함수
## -----------------------------------------------------
def printMenu():
    print(f'{"선택":-^10}')
    print(f'{" 1. 입  력":<12}')
    print(f'{" 2. 목  록":<12}')
    print(f'{" X. 종  료":<12}')
    print(f'{"":-^12}')

## [1]
## -----------------------------------------------------
## 이름과 전화번호 입력 함수
## -----------------------------------------------------
def inputContact():
    name = input("이름 입력: ")
    number = input("전화번호 입력: ")
    phonebook.append((name, number))
    print("저장 완료!")

## [2]
## -----------------------------------------------------
## 저장된 목록 출력 함수
## -----------------------------------------------------
def showContacts():
    print("[연락처 목록]")
    for contact in phonebook:
        print(contact)


## -----------------------------------------------------
## 메인 프로그램 실행
## -----------------------------------------------------
print(f'{"연락처 저장":^8}')

while True:
    printMenu()
    cmd = input("선택: ")

    if cmd in ['X', 'x']:
        break
    elif cmd == '1':
        inputContact()
    elif cmd == '2':
        showContacts()
    else:
        print("존재하지 않는 항목입니다.")

print("연락처 종료")
